[
    {
        "name": "dwarf",
        "description": "Stout and stubborn, a dwarf is known for their tenacity with metalwork and ores.  They can often be found in deep recesses of mountains, underground and generally keeping to themselves.",
        "age": "Dwarves mature at the same rate as humans, but they’re considered young until they reach the age of 50. On average, they live about 350 years.",
        "alignment": "Most dwarves are lawful, believing firmly in the benefits of a well-­‐‑ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.",
        "physique": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds.",
        "size": "medium",
        "senses": [{
            "name": "dark",
            "range": 60
            "description": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can’t discern color in darkness, only shades of gray."}],
        "features": [{
                "title": "Dwarven Resilience",
                "description": "You have advantage on saving throws against poison, and you have resistance against poison damage.",
            },{
                "title": "Dwarven Combat Training",
                "description": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.",
            }, {
                "title": "Tool Proficiency",
                "description": "You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools."
            }, {
                "title": "Stonecunning",
                "description": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
            }
            
        ],
        
        "statIncrease":[{
            "con": 2    }],
        "baseLanguages": [
            "common",
            "dwarvish"      ],
    }
]
