[{
        "name": "dwarf",
        "description": "Stout and stubborn, a dwarf is known for their tenacity with metalwork and ores.  They can often be found in deep recesses of mountains, underground and generally keeping to themselves.",
        "age": "Dwarves mature at the same rate as humans, but they’re considered young until they reach the age of 50. On average, they live about 350 years.",
        "alignment": "Most dwarves are lawful, believing firmly in the benefits of a well-­‐‑ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.",
        "physique": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds.",
        "size": "medium",
        "hasDarkvision": true,
        "speed": 30,
        "features": [{
                "title": "Dwarven Resilience",
                "description": "You have advantage on saving throws against poison, and you have resistance against poison damage."
            },
            {
                "title": "Dwarven Combat Training",
                "description": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer."
            },
            {
                "title": "Tool Proficiency",
                "description": "You gain proficiency with the artisan’s tools of your choice: smith’s tools, brewer’s supplies, or mason’s tools.",
                "options": ["smith’s tools", "brewer’s supplies", "mason’s tools"]
            },
            {
                "title": "Stonecunning",
                "description": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus."
            }
        ],
        "abilityScoreModifiers": [{
            "stat": "con",
            "value": 2,
            "origin": "race"
        }],
        "baseLanguages": [
            "common",
            "dwarvish"
        ],
        "subraces": [{
            "name": "hill dwarf",
            "description": "As a hill dwarf, you have keen senses, deep intuition, and remarkable resilience.",
            "abilityScoreModifiers": [{
                "stat": "wis",
                "value": 1,
                "origin": "subrace"
            }],
            "features": [{
                "title": "Dwarven Toughness",
                "description": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level."
            }]
        }]
    },
    {
        "name": "elf",
        "description": "The elves posess grace unlike any other, seeming to move quickly through sunbeams without so much as a hint of disruption.  Learning new magicks come easily to them, as do many other works that marry art, craft and deep wisdom.",
        "age": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.",
        "alignment": "Elves love freedom, variety, and self-­‐‑ expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others’ freedom as well as their own, and they are more often good than not.",
        "physique": "Elves range from under 5 to over 6 feet tall and have slender builds. ",
        "size": "medium",
        "hasDarkvision": true,
        "speed": 30,
        "features": [{
                "title": "Keen Senses",
                "description": "You have proficiency in the Perception skill."
            },
            {
                "title": "Fey Ancestry",
                "description": "You have advantage on saving throws against being charmed, and magic can’t put you to sleep."
            },
            {
                "title": "Trance",
                "description": "Elves don’t need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep."
            }
        ],
        "abilityScoreModifiers": [{
            "stat": "dex",
            "value": 2,
            "origin": "race"
        }],
        "baseLanguages": [
            "common",
            "elvish"
        ],
        "subraces": [{
            "name": "high elf",
            "description": "As a high elf, you have a keen mind and a mastery of at least the basics of magic. In many fantasy gaming worlds, there are two kinds of high elves. One type is haughty and reclusive, believing themselves to be superior to non-­elves and even other elves. The other type is more common and more friendly, and often encountered among humans and other races.",
            "abilityScoreModifiers": [{
                "stat": "int",
                "value": 1,
                "origin": "subrace"
            }],
            "features": [{
                    "title": "Elf Weapon Training",
                    "description": "You have proficiency with the longsword, shortsword, shortbow, and longbow."
                },
                {
                    "title": "Cantrip",
                    "description": "You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it.",
                    "options": ["Acid Splash", "Chill Touch", "Dancing Lights", "Fire Bolt", "Light", "Mage Hand", "Mending", "Message", "Minor Illusion", "Poison Spray", "Prestidigitation", "Ray of Frost", "Shocking Grasp", "True Strike"]
                },
                {
                    "title": "Extra Language",
                    "description": "You can speak, read, and write one extra language of your choice.",
                    "options": ["common", "dwarvish", "elvish", "giant", "gnomish", "goblin", "halfling", "orc"]
                }
            ]
        }]
    },
    {
        "name": "halfling",
        "description": "A comfortable home and the happiness of friends are what most halflings desire.  They tend to avoid the adventuring life, though some are willing to ignore the expectation of the domestic life to see the world.",
        "age": "A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.",
        "alignment": "Most halflings are lawful good. As a rule, they are good-­‐‑hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways.",
        "physique": "Halflings average about 3 feet tall and weigh about 40 pounds",
        "size": "small",
        "speed": 25,
        "features": [{
                "title": "Lucky",
                "description": "When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
            },
            {
                "title": "Brave",
                "description": "You have advantage on saving throws against being frightened."
            },
            {
                "title": "Halfling Nimbleness",
                "description": "You can move through the space of any creature that is of a size larger than yours."
            }
        ],
        "abilityScoreModifiers": [{
            "stat": "dex",
            "value": 2,
            "origin": "race"
        }],
        "baseLanguages": [
            "common",
            "halfling"
        ],
        "subraces": [{
            "name": "lightfoot halfling",
            "description": "As a lightfoot halfling, you can easily hide from notice, even using other people as cover. You’re inclined to be affable and get along well with others. Lightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life.",
            "abilityScoreModifiers": [{
                "stat": "cha",
                "value": 1,
                "origin": "subrace"
            }],
            "features": [{
                "title": "Naturally Stealthy",
                "description": "You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you."
            }]
        }]
    },
    {
        "name": "human",
        "description": "Humankind has reached every corner of the world, giving them an advantage in numbers, and unmatched diversity in their abilities.  Wise scholars, brave fighters and famous performers have been humans.  Their great ambition and innovation is unlike any other race and has allowed them to make a significant impact in the state of the world.",
        "age": "Humans reach adulthood in their late teens and live less than a century.",
        "alignment": "Humans tend toward no particular alignment. The best and the worst are found among them.",
        "physique": "Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall.",
        "size": "medium",
        "speed": 30,
        "features": [

        ],
        "abilityScoreModifiers": [{
                "stat": "str",
                "value": 1,
                "origin": "race"
            },
            {
                "stat": "con",
                "value": 1,
                "origin": "race"
            },
            {
                "stat": "dex",
                "value": 1,
                "origin": "race"
            },
            {
                "stat": "cha",
                "value": 1,
                "origin": "race"
            },
            {
                "stat": "wis",
                "value": 1,
                "origin": "race"
            },
            {
                "stat": "int",
                "value": 1,
                "origin": "race"
            }
        ],
        "baseLanguages": [
            "common",
            "choice"
        ]
    },
    {
        "name": "dragonborn",
        "description": "",
        "age": "Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.",
        "alignment": "Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil. Most dragonborn are good, but those who side with evil can be terrible villains.",
        "physique": "Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds.",
        "size": "medium",
        "speed": 30,
        "features": [{
                "title": "Draconic Ancestry",
                "description": "You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.",
                "options": ["Black", "Blue", "Brass", "Bronze", "Copper", "Gold", "Green", "Red", "Silver", "White"]
            },
            {
                "title": "Breath Weapon",
                "description": "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation. When you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level. After you use your breath weapon, you can’t use it again until you complete a short or long rest."
            },
            {
                "title": "Damage Resistance",
                "description": "You have resistance to the damage type associated with your draconic ancestry."
            }
        ],
        "abilityScoreModifiers": [{
                "stat": "str",
                "value": 2,
                "origin": "race"
            },
            {
                "stat": "cha",
                "value": 1,
                "origin": "race"
            }
        ],
        "baseLanguages": [
            "common",
            "draconic"
        ]
    },
    {
        "name": "gnome",
        "description": "",
        "age": "Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.",
        "alignment": "Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-­‐‑hearted, and even the tricksters among them are more playful than vicious.",
        "physique": "Gnomes are between 3 and 4 feet tall and average about 40 pounds.",
        "size": "small",
        "speed": 25,
        "hasDarkvision": true,
        "features": [{
            "title": "Gnome Cunning",
            "description": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic."
        }],
        "abilityScoreModifiers": [{
            "stat": "int",
            "value": 2,
            "origin": "race"
        }],
        "baseLanguages": [
            "common",
            "gnomish"
        ],
        "subraces": [{
            "name": "rock gnome",
            "description": "As a rock gnome, you have a natural inventiveness and hardiness beyond that of other gnomes.",
            "abilityScoreModifiers": [{
                "stat": "con",
                "value": 1,
                "origin": "race"
            }],
            "features": [{
                    "title": "Artificer’s Lore",
                    "description": "Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply."
                },
                {
                    "title": "Tinker",
                    "description": "You have proficiency with artisan’s tools (tinker’s tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time. When you create a device, choose one of the following options: Clockwork Toy. This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents. Fire Starter. The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action. Music Box. When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song’s end or when it is closed."
                }
            ]
        }]
    },
    {
        "name": "half-elf",
        "description": "",
        "age": "Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years.",
        "alignment": "Half-­elves share the chaotic bent of their elven heritage. They value both personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others’ demands, and sometimes prove unreliable, or at least unpredictable.",
        "physique": "Half-­elves are about the same size as humans, ranging from 5 to 6 feet tall.",
        "size": "medium",
        "speed": 30,
        "hasDarkvision": true,
        "features": [{
                "title": "Fey Ancestry",
                "description": "You have advantage on saving throws against being charmed, and magic can’t put you to sleep."
            },
            {
                "title": "Skill Versatility",
                "description": "You gain proficiency in two skills of your choice.",
                "selectionLimit": 2,
                "options": ["Athletics", "Acrobatics", "Sleight of Hand", "Stealth", "Arcana", "History", "Investigation", "Nature", "Religion", "Animal Handling", "Insight", "Medicine", "Perception", "Survival", "Intimidation", "Performance", "Persuasion"]
            },
            {
                "title": "Human Lineage",
                "description": "Two ability scores of your choice increase by 1.",
                "selectionLimit": 2,
                "options": ["strength", "constitution", "dexterity", "charisma", "wisdom", "intelligence"]
            }
        ],
        "abilityScoreModifiers": [{
            "stat": "cha",
            "value": 2,
            "origin": "race"
        }],
        "baseLanguages": [
            "common",
            "elvish",
            "choice"
        ]
    },
    {
        "name": "Half-Orc",
        "description": "",
        "age": "Half-­orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.",
        "alignment": "Half-­orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-­orcs raised among orcs and willing to live out their lives among them are usually evil.",
        "physique": "Half-­orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall.",
        "size": "medium",
        "speed": 30,
        "hasDarkvision": true,
        "features": [{
                "title": "Menacing",
                "description": "You gain proficiency in the Intimidation skill."
            },
            {
                "title": "Relentless Endurance",
                "description": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."
            },
            {
                "title": "Savage Attacks",
                "description": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon’s damage dice one additional time and add it to the extra damage of the critical hit."
            }
        ],
        "abilityScoreModifiers": [{
            "stat": "str",
            "value": 2,
            "origin": "race"
        }, {
            "stat": "con",
            "value": 1,
            "origin": "race"
        }],
        "baseLanguages": [
            "common",
            "orc"
        ]
    },
    {
        "name": "tiefling",
        "description": "",
        "age": "Tieflings mature at the same rate as humans but live a few years longer.",
        "alignment": "Tieflings might not have an innate tendency toward evil, but many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment.",
        "physique": "Tieflings are about the same size and build as humans.",
        "size": "medium",
        "speed": 30,
        "hasDarkvision": true,
        "features": [{
                "title": "Hellish Resistance",
                "description": "You have resistance to fire damage."
            },
            {
                "title": "Infernal Legacy",
                "description": "You know the thaumaturgy cantrip. When you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-­level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the darkness spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells."
            }
        ],
        "abilityScoreModifiers": [{
            "stat": "cha",
            "value": 2,
            "origin": "race"
        }, {
            "stat": "int",
            "value": 1,
            "origin": "race"
        }],
        "baseLanguages": [
            "common",
            "infernal"
        ]
    }
]
